###################################################################

# Created by write_sdc on Mon May 14 22:28:25 2018

###################################################################
set sdc_version 2.0

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current mA
set_load -pin_load 1 [get_ports {data_out[7]}]
set_load -pin_load 1 [get_ports {data_out[6]}]
set_load -pin_load 1 [get_ports {data_out[5]}]
set_load -pin_load 1 [get_ports {data_out[4]}]
set_load -pin_load 1 [get_ports {data_out[3]}]
set_load -pin_load 1 [get_ports {data_out[2]}]
set_load -pin_load 1 [get_ports {data_out[1]}]
set_load -pin_load 1 [get_ports {data_out[0]}]
set_load -pin_load 1 [get_ports {overflow_flag[1]}]
set_load -pin_load 1 [get_ports {overflow_flag[0]}]
set_load -pin_load 1 [get_ports {done[0]}]
create_clock [get_ports clk]  -period 50  -waveform {0 25}
group_path -name FEEDTHROUGH  -from [list [get_ports rst_n] [get_ports {data_in[7]}] [get_ports {data_in[6]}] [get_ports {data_in[5]}] [get_ports {data_in[4]}] [get_ports {data_in[3]}] [get_ports {data_in[2]}] [get_ports {data_in[1]}] [get_ports {data_in[0]}] [get_ports enable] [get_ports configuration] [get_ports config_data_enable]]  -to [list [get_ports {data_out[7]}] [get_ports {data_out[6]}] [get_ports {data_out[5]}] [get_ports {data_out[4]}] [get_ports {data_out[3]}] [get_ports {data_out[2]}] [get_ports {data_out[1]}] [get_ports {data_out[0]}] [get_ports {overflow_flag[1]}] [get_ports {overflow_flag[0]}] [get_ports {done[0]}]]
group_path -name REGIN  -from [list [get_ports rst_n] [get_ports {data_in[7]}] [get_ports {data_in[6]}] [get_ports {data_in[5]}] [get_ports {data_in[4]}] [get_ports {data_in[3]}] [get_ports {data_in[2]}] [get_ports {data_in[1]}] [get_ports {data_in[0]}] [get_ports enable] [get_ports configuration] [get_ports config_data_enable]]
group_path -name REGOUT  -to [list [get_ports {data_out[7]}] [get_ports {data_out[6]}] [get_ports {data_out[5]}] [get_ports {data_out[4]}] [get_ports {data_out[3]}] [get_ports {data_out[2]}] [get_ports {data_out[1]}] [get_ports {data_out[0]}] [get_ports {overflow_flag[1]}] [get_ports {overflow_flag[0]}] [get_ports {done[0]}]]
set_input_delay -clock clk  -max 10  [get_ports rst_n]
set_input_delay -clock clk  -max 10  [get_ports {data_in[7]}]
set_input_delay -clock clk  -max 10  [get_ports {data_in[6]}]
set_input_delay -clock clk  -max 10  [get_ports {data_in[5]}]
set_input_delay -clock clk  -max 10  [get_ports {data_in[4]}]
set_input_delay -clock clk  -max 10  [get_ports {data_in[3]}]
set_input_delay -clock clk  -max 10  [get_ports {data_in[2]}]
set_input_delay -clock clk  -max 10  [get_ports {data_in[1]}]
set_input_delay -clock clk  -max 10  [get_ports {data_in[0]}]
set_input_delay -clock clk  -max 10  [get_ports enable]
set_input_delay -clock clk  -max 10  [get_ports configuration]
set_input_delay -clock clk  -max 10  [get_ports config_data_enable]
set_output_delay -clock clk  -max 10  [get_ports {data_out[7]}]
set_output_delay -clock clk  -max 10  [get_ports {data_out[6]}]
set_output_delay -clock clk  -max 10  [get_ports {data_out[5]}]
set_output_delay -clock clk  -max 10  [get_ports {data_out[4]}]
set_output_delay -clock clk  -max 10  [get_ports {data_out[3]}]
set_output_delay -clock clk  -max 10  [get_ports {data_out[2]}]
set_output_delay -clock clk  -max 10  [get_ports {data_out[1]}]
set_output_delay -clock clk  -max 10  [get_ports {data_out[0]}]
set_output_delay -clock clk  -max 10  [get_ports {overflow_flag[1]}]
set_output_delay -clock clk  -max 10  [get_ports {overflow_flag[0]}]
set_output_delay -clock clk  -max 10  [get_ports {done[0]}]
set_input_transition -max 0.1  [get_ports rst_n]
set_input_transition -min 0.1  [get_ports rst_n]
set_input_transition -max 0.1  [get_ports {data_in[7]}]
set_input_transition -min 0.1  [get_ports {data_in[7]}]
set_input_transition -max 0.1  [get_ports {data_in[6]}]
set_input_transition -min 0.1  [get_ports {data_in[6]}]
set_input_transition -max 0.1  [get_ports {data_in[5]}]
set_input_transition -min 0.1  [get_ports {data_in[5]}]
set_input_transition -max 0.1  [get_ports {data_in[4]}]
set_input_transition -min 0.1  [get_ports {data_in[4]}]
set_input_transition -max 0.1  [get_ports {data_in[3]}]
set_input_transition -min 0.1  [get_ports {data_in[3]}]
set_input_transition -max 0.1  [get_ports {data_in[2]}]
set_input_transition -min 0.1  [get_ports {data_in[2]}]
set_input_transition -max 0.1  [get_ports {data_in[1]}]
set_input_transition -min 0.1  [get_ports {data_in[1]}]
set_input_transition -max 0.1  [get_ports {data_in[0]}]
set_input_transition -min 0.1  [get_ports {data_in[0]}]
set_input_transition -max 0.1  [get_ports enable]
set_input_transition -min 0.1  [get_ports enable]
set_input_transition -max 0.1  [get_ports configuration]
set_input_transition -min 0.1  [get_ports configuration]
set_input_transition -max 0.1  [get_ports config_data_enable]
set_input_transition -min 0.1  [get_ports config_data_enable]
