###################################################################

# Created by write_sdc on Fri May 11 23:37:19 2018

###################################################################
set sdc_version 2.0

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current mA
set_load -pin_load 1 [get_ports {data_out[17]}]
set_load -pin_load 1 [get_ports {data_out[16]}]
set_load -pin_load 1 [get_ports {data_out[15]}]
set_load -pin_load 1 [get_ports {data_out[14]}]
set_load -pin_load 1 [get_ports {data_out[13]}]
set_load -pin_load 1 [get_ports {data_out[12]}]
set_load -pin_load 1 [get_ports {data_out[11]}]
set_load -pin_load 1 [get_ports {data_out[10]}]
set_load -pin_load 1 [get_ports {data_out[9]}]
set_load -pin_load 1 [get_ports {data_out[8]}]
set_load -pin_load 1 [get_ports {data_out[7]}]
set_load -pin_load 1 [get_ports {data_out[6]}]
set_load -pin_load 1 [get_ports {data_out[5]}]
set_load -pin_load 1 [get_ports {data_out[4]}]
set_load -pin_load 1 [get_ports {data_out[3]}]
set_load -pin_load 1 [get_ports {data_out[2]}]
set_load -pin_load 1 [get_ports {data_out[1]}]
set_load -pin_load 1 [get_ports {data_out[0]}]
set_load -pin_load 1 [get_ports calculation_done]
create_clock [get_ports clk]  -period 20000  -waveform {0 10000}
group_path -name FEEDTHROUGH  -from [list [get_ports rst_n] [get_ports {data_in[15]}] [get_ports {data_in[14]}] [get_ports {data_in[13]}] [get_ports {data_in[12]}] [get_ports {data_in[11]}] [get_ports {data_in[10]}] [get_ports {data_in[9]}] [get_ports {data_in[8]}] [get_ports {data_in[7]}] [get_ports {data_in[6]}] [get_ports {data_in[5]}] [get_ports {data_in[4]}] [get_ports {data_in[3]}] [get_ports {data_in[2]}] [get_ports {data_in[1]}] [get_ports {data_in[0]}] [get_ports enable]]  -to [list [get_ports {data_out[17]}] [get_ports {data_out[16]}] [get_ports {data_out[15]}] [get_ports {data_out[14]}] [get_ports {data_out[13]}] [get_ports {data_out[12]}] [get_ports {data_out[11]}] [get_ports {data_out[10]}] [get_ports {data_out[9]}] [get_ports {data_out[8]}] [get_ports {data_out[7]}] [get_ports {data_out[6]}] [get_ports {data_out[5]}] [get_ports {data_out[4]}] [get_ports {data_out[3]}] [get_ports {data_out[2]}] [get_ports {data_out[1]}] [get_ports {data_out[0]}] [get_ports calculation_done]]
group_path -name REGIN  -from [list [get_ports rst_n] [get_ports {data_in[15]}] [get_ports {data_in[14]}] [get_ports {data_in[13]}] [get_ports {data_in[12]}] [get_ports {data_in[11]}] [get_ports {data_in[10]}] [get_ports {data_in[9]}] [get_ports {data_in[8]}] [get_ports {data_in[7]}] [get_ports {data_in[6]}] [get_ports {data_in[5]}] [get_ports {data_in[4]}] [get_ports {data_in[3]}] [get_ports {data_in[2]}] [get_ports {data_in[1]}] [get_ports {data_in[0]}] [get_ports enable]]
group_path -name REGOUT  -to [list [get_ports {data_out[17]}] [get_ports {data_out[16]}] [get_ports {data_out[15]}] [get_ports {data_out[14]}] [get_ports {data_out[13]}] [get_ports {data_out[12]}] [get_ports {data_out[11]}] [get_ports {data_out[10]}] [get_ports {data_out[9]}] [get_ports {data_out[8]}] [get_ports {data_out[7]}] [get_ports {data_out[6]}] [get_ports {data_out[5]}] [get_ports {data_out[4]}] [get_ports {data_out[3]}] [get_ports {data_out[2]}] [get_ports {data_out[1]}] [get_ports {data_out[0]}] [get_ports calculation_done]]
set_input_delay -clock clk  -max 12000  [get_ports rst_n]
set_input_delay -clock clk  -max 12000  [get_ports {data_in[15]}]
set_input_delay -clock clk  -max 12000  [get_ports {data_in[14]}]
set_input_delay -clock clk  -max 12000  [get_ports {data_in[13]}]
set_input_delay -clock clk  -max 12000  [get_ports {data_in[12]}]
set_input_delay -clock clk  -max 12000  [get_ports {data_in[11]}]
set_input_delay -clock clk  -max 12000  [get_ports {data_in[10]}]
set_input_delay -clock clk  -max 12000  [get_ports {data_in[9]}]
set_input_delay -clock clk  -max 12000  [get_ports {data_in[8]}]
set_input_delay -clock clk  -max 12000  [get_ports {data_in[7]}]
set_input_delay -clock clk  -max 12000  [get_ports {data_in[6]}]
set_input_delay -clock clk  -max 12000  [get_ports {data_in[5]}]
set_input_delay -clock clk  -max 12000  [get_ports {data_in[4]}]
set_input_delay -clock clk  -max 12000  [get_ports {data_in[3]}]
set_input_delay -clock clk  -max 12000  [get_ports {data_in[2]}]
set_input_delay -clock clk  -max 12000  [get_ports {data_in[1]}]
set_input_delay -clock clk  -max 12000  [get_ports {data_in[0]}]
set_input_delay -clock clk  -max 12000  [get_ports enable]
set_output_delay -clock clk  -max 12000  [get_ports {data_out[17]}]
set_output_delay -clock clk  -max 12000  [get_ports {data_out[16]}]
set_output_delay -clock clk  -max 12000  [get_ports {data_out[15]}]
set_output_delay -clock clk  -max 12000  [get_ports {data_out[14]}]
set_output_delay -clock clk  -max 12000  [get_ports {data_out[13]}]
set_output_delay -clock clk  -max 12000  [get_ports {data_out[12]}]
set_output_delay -clock clk  -max 12000  [get_ports {data_out[11]}]
set_output_delay -clock clk  -max 12000  [get_ports {data_out[10]}]
set_output_delay -clock clk  -max 12000  [get_ports {data_out[9]}]
set_output_delay -clock clk  -max 12000  [get_ports {data_out[8]}]
set_output_delay -clock clk  -max 12000  [get_ports {data_out[7]}]
set_output_delay -clock clk  -max 12000  [get_ports {data_out[6]}]
set_output_delay -clock clk  -max 12000  [get_ports {data_out[5]}]
set_output_delay -clock clk  -max 12000  [get_ports {data_out[4]}]
set_output_delay -clock clk  -max 12000  [get_ports {data_out[3]}]
set_output_delay -clock clk  -max 12000  [get_ports {data_out[2]}]
set_output_delay -clock clk  -max 12000  [get_ports {data_out[1]}]
set_output_delay -clock clk  -max 12000  [get_ports {data_out[0]}]
set_output_delay -clock clk  -max 12000  [get_ports calculation_done]
set_input_transition -max 0.1  [get_ports rst_n]
set_input_transition -min 0.1  [get_ports rst_n]
set_input_transition -max 0.1  [get_ports {data_in[15]}]
set_input_transition -min 0.1  [get_ports {data_in[15]}]
set_input_transition -max 0.1  [get_ports {data_in[14]}]
set_input_transition -min 0.1  [get_ports {data_in[14]}]
set_input_transition -max 0.1  [get_ports {data_in[13]}]
set_input_transition -min 0.1  [get_ports {data_in[13]}]
set_input_transition -max 0.1  [get_ports {data_in[12]}]
set_input_transition -min 0.1  [get_ports {data_in[12]}]
set_input_transition -max 0.1  [get_ports {data_in[11]}]
set_input_transition -min 0.1  [get_ports {data_in[11]}]
set_input_transition -max 0.1  [get_ports {data_in[10]}]
set_input_transition -min 0.1  [get_ports {data_in[10]}]
set_input_transition -max 0.1  [get_ports {data_in[9]}]
set_input_transition -min 0.1  [get_ports {data_in[9]}]
set_input_transition -max 0.1  [get_ports {data_in[8]}]
set_input_transition -min 0.1  [get_ports {data_in[8]}]
set_input_transition -max 0.1  [get_ports {data_in[7]}]
set_input_transition -min 0.1  [get_ports {data_in[7]}]
set_input_transition -max 0.1  [get_ports {data_in[6]}]
set_input_transition -min 0.1  [get_ports {data_in[6]}]
set_input_transition -max 0.1  [get_ports {data_in[5]}]
set_input_transition -min 0.1  [get_ports {data_in[5]}]
set_input_transition -max 0.1  [get_ports {data_in[4]}]
set_input_transition -min 0.1  [get_ports {data_in[4]}]
set_input_transition -max 0.1  [get_ports {data_in[3]}]
set_input_transition -min 0.1  [get_ports {data_in[3]}]
set_input_transition -max 0.1  [get_ports {data_in[2]}]
set_input_transition -min 0.1  [get_ports {data_in[2]}]
set_input_transition -max 0.1  [get_ports {data_in[1]}]
set_input_transition -min 0.1  [get_ports {data_in[1]}]
set_input_transition -max 0.1  [get_ports {data_in[0]}]
set_input_transition -min 0.1  [get_ports {data_in[0]}]
set_input_transition -max 0.1  [get_ports enable]
set_input_transition -min 0.1  [get_ports enable]
