###############################################################
#  Generated by:      Cadence Encounter 14.26-s039_1
#  OS:                Linux x86_64(Host ID EEX109)
#  Generated on:      Wed May 16 12:04:10 2018
#  Design:            FIR
#  Command:           saveDesign db/FIR_postroute.enc
###############################################################
current_design FIR
create_clock [get_ports {clk}]  -name clk -period 50.000000 -waveform {0.000000 25.000000}
set_clock_latency -min  -rise 0.087153  [get_clocks {clk}]
set_clock_latency -min  -fall 0.093808  [get_clocks {clk}]
set_propagated_clock  [get_ports {clk}]
set_input_transition 0.1  [get_ports {rst_n}]
set_input_transition 0.1  [get_ports {data_in[7]}]
set_input_transition 0.1  [get_ports {data_in[6]}]
set_input_transition 0.1  [get_ports {data_in[5]}]
set_input_transition 0.1  [get_ports {data_in[4]}]
set_input_transition 0.1  [get_ports {data_in[3]}]
set_input_transition 0.1  [get_ports {data_in[2]}]
set_input_transition 0.1  [get_ports {data_in[1]}]
set_input_transition 0.1  [get_ports {data_in[0]}]
set_input_transition 0.1  [get_ports {enable}]
set_input_transition 0.1  [get_ports {configuration}]
set_input_transition 0.1  [get_ports {config_data_enable}]
set_load -pin_load -max  1  [get_ports {data_out[7]}]
set_load -pin_load -min  1  [get_ports {data_out[7]}]
set_load -pin_load -max  1  [get_ports {data_out[6]}]
set_load -pin_load -min  1  [get_ports {data_out[6]}]
set_load -pin_load -max  1  [get_ports {data_out[5]}]
set_load -pin_load -min  1  [get_ports {data_out[5]}]
set_load -pin_load -max  1  [get_ports {data_out[4]}]
set_load -pin_load -min  1  [get_ports {data_out[4]}]
set_load -pin_load -max  1  [get_ports {data_out[3]}]
set_load -pin_load -min  1  [get_ports {data_out[3]}]
set_load -pin_load -max  1  [get_ports {data_out[2]}]
set_load -pin_load -min  1  [get_ports {data_out[2]}]
set_load -pin_load -max  1  [get_ports {data_out[1]}]
set_load -pin_load -min  1  [get_ports {data_out[1]}]
set_load -pin_load -max  1  [get_ports {data_out[0]}]
set_load -pin_load -min  1  [get_ports {data_out[0]}]
set_load -pin_load -max  1  [get_ports {overflow_flag[1]}]
set_load -pin_load -min  1  [get_ports {overflow_flag[1]}]
set_load -pin_load -max  1  [get_ports {overflow_flag[0]}]
set_load -pin_load -min  1  [get_ports {overflow_flag[0]}]
set_load -pin_load -max  1  [get_ports {done[0]}]
set_load -pin_load -min  1  [get_ports {done[0]}]
set_input_delay -add_delay 10 -max -clock [get_clocks {clk}] [get_ports {data_in[4]}]
set_input_delay -add_delay 10 -max -clock [get_clocks {clk}] [get_ports {data_in[2]}]
set_input_delay -add_delay 10 -max -clock [get_clocks {clk}] [get_ports {rst_n}]
set_input_delay -add_delay 10 -max -clock [get_clocks {clk}] [get_ports {data_in[0]}]
set_input_delay -add_delay 10 -max -clock [get_clocks {clk}] [get_ports {configuration}]
set_input_delay -add_delay 10 -max -clock [get_clocks {clk}] [get_ports {config_data_enable}]
set_input_delay -add_delay 10 -max -clock [get_clocks {clk}] [get_ports {data_in[7]}]
set_input_delay -add_delay 10 -max -clock [get_clocks {clk}] [get_ports {data_in[5]}]
set_input_delay -add_delay 10 -max -clock [get_clocks {clk}] [get_ports {enable}]
set_input_delay -add_delay 10 -max -clock [get_clocks {clk}] [get_ports {data_in[3]}]
set_input_delay -add_delay 10 -max -clock [get_clocks {clk}] [get_ports {data_in[1]}]
set_input_delay -add_delay 10 -max -clock [get_clocks {clk}] [get_ports {data_in[6]}]
set_output_delay -add_delay 10 -max -clock [get_clocks {clk}] [get_ports {done[0]}]
set_output_delay -add_delay 10 -max -clock [get_clocks {clk}] [get_ports {overflow_flag[1]}]
set_output_delay -add_delay 10 -max -clock [get_clocks {clk}] [get_ports {data_out[7]}]
set_output_delay -add_delay 10 -max -clock [get_clocks {clk}] [get_ports {data_out[5]}]
set_output_delay -add_delay 10 -max -clock [get_clocks {clk}] [get_ports {data_out[3]}]
set_output_delay -add_delay 10 -max -clock [get_clocks {clk}] [get_ports {data_out[1]}]
set_output_delay -add_delay 10 -max -clock [get_clocks {clk}] [get_ports {overflow_flag[0]}]
set_output_delay -add_delay 10 -max -clock [get_clocks {clk}] [get_ports {data_out[6]}]
set_output_delay -add_delay 10 -max -clock [get_clocks {clk}] [get_ports {data_out[4]}]
set_output_delay -add_delay 10 -max -clock [get_clocks {clk}] [get_ports {data_out[2]}]
set_output_delay -add_delay 10 -max -clock [get_clocks {clk}] [get_ports {data_out[0]}]
